backend/controllers/OrderCustomerController.php

SELECT `menuwarung_id` FROM `order_item_customer` WHERE `ordercustomer_id`='1'
SELECT * FROM `menu_warung` WHERE `idmenu` IN (2, 4)
---
    public function actionDetail($id) {
      $itemId = array();
      $orderItem = OrderItemCustomer::find()->select(['menuwarung_id'])->where(['ordercustomer_id'=>$id])->all();
      for($i = 0; $i < count($orderItem); $i++){
        $itemId[] = $orderItem[$i]->menuwarung_id;
      }
      $item = MenuWarung::find()->where(['idmenu'=>$itemId])->all();