backend/controllers/SiteController.php

SELECT * FROM `pengguna`
---
    public function actionIndex()
    {
        $users = Pengguna::find()->all();