frontend/controllers/OrderCustomerController.php

SELECT MAX(idordercustomer) FROM `order_customer`
INSERT INTO `order_customer` (`idordercustomer`, `user_id`, `tanggal`, `lokasi`, `catatan`, `total`) VALUES (2, 1, '2019-06-12 01:43:44', 'gedung d4', 'cepetan ya', 12000)
---
    public function actionCreate()
    {
        $model = new OrderCustomer();
        $user = new Pengguna();
        $model->idordercustomer = OrderCustomer::find()->max('idordercustomer')+1;
        $model->user_id = Yii::$app->user->getId();
        $idorder = $model->idordercustomer;
        //$user->iduser;
        $model->tanggal = date('Y-m-d H:i:s');

        if ($model->load(Yii::$app->request->post()) && $model->save()) {