frontend/controllers/OrderTipersController.php

    public function actionIndex()
    {
        $model = OrderTipers::find()->all();
---
SELECT * FROM `order_tipers`