frontend/controllers/SiteController.php

SELECT * FROM `order_tipers`
SELECT * FROM `lokasi`
INSERT INTO `order_tipers` (`fee`, `lokasi_id`, `catatan`, `user_id`) VALUES (2000, 1, 'tes', 1)
---
    public function actionTipers(){
          $_SESSION['role'] = 1;
          $modelTitipan = OrderTipers::find()->all();
          $modelOrder = new OrderTipers();
          $namalokasi = Lokasi::find()->all();
          $namalokasi = ArrayHelper::map($namalokasi, 'idlokasi','name');
          if ($modelOrder->load(Yii::$app->request->post()) ) {
              $modelOrder->user_id=1;
              $modelOrder->save();

SELECT * FROM `order_tipers`
SELECT * FROM `lokasi`
---
    public function actionCustomer(){
          $_SESSION['role'] = 2;
          $modelOrder = new Order_Tipers();
          $mymodel = OrderTipers::find()->all();
          $namalokasi = Lokasi::find()->all();
          $namalokasi = ArrayHelper::map($namalokasi, 'idlokasi','name');
          if ($modelOrder->load(Yii::$app->request->post()) ) {