frontend/controllers/WarungController.php

SELECT * FROM `order_tipers` WHERE `idordertipers`='1'
---
    public function actionIndex($id)
    {
        $_SESSION['idordertipers'] = OrderTipers::findOne($id);

SELECT * FROM `warung`
---
    public function actionMenu($id)
    {
      $warung = Warung::find()->all();