frontend/models/Pengguna.php

SELECT * FROM `pengguna` WHERE `nrp`='2110171002'
---
    public static function findByUsername($nrp){
    	return self::findOne(['nrp'=>$nrp]);